
#include "Delay.h"

static u8  fac_us=0;//us延时倍乘数
static u16 fac_ms=0;//ms延时倍乘数
//===================================================================== 
//函 数 名:	Delay_InitConfig(u8 SYSCLK)
//功    能: 初始化延迟函数 
//入口参数: SYSCLK:系统时钟
//返 回 值: 无
//=====================================================================
void Delay_InitConfig(u8 SYSCLK)
{
	SysTick->CTRL&=~(1<<2);	//SYSTICK使用外部时钟源	 
	fac_us=SYSCLK/8;		//不论是否使用ucos,fac_us都需要使用
	fac_ms=(u16)fac_us*1000;//非ucos下,代表每个ms需要的systick时钟数  
}
//===================================================================== 
//函 数 名:delay_us(u32 nus)
//功    能: us延时 
//入口参数: nus为要延时的us数
//返 回 值: 无
//=====================================================================   	    								   
void delay_us(u32 nus)
{		
	uint32_t temp = nus*10;
	while(temp--);	


//	u32 temp;	    	 
	SysTick->LOAD=nus*fac_us; //时间加载	  		 
	SysTick->VAL=0x00;        //清空计数器
	SysTick->CTRL=0x01 ;      //开始倒数 	 
	do
	{
		temp=SysTick->CTRL;
	}
	while((temp&0x01)&&!(temp&(1<<16)));//等待时间到达   
	SysTick->CTRL=0x00;       //关闭计数器
	SysTick->VAL =0X00;       //清空计数器	 
	


}
//===================================================================== 
//函 数 名:	delay_ms(u16 nms)
//功    能: ms延时
//入口参数: 
//返 回 值: 无								    
//=====================================================================
void delay_ms(u16 nms)
{	 
		 
  u32 temp;		   
	SysTick->LOAD=(u32)nms*fac_ms;//时间加载(SysTick->LOAD为24bit)
	SysTick->VAL =0x00;           //清空计数器
	SysTick->CTRL=0x01 ;          //开始倒数  
	do
	{
		temp=SysTick->CTRL;
	}
	while((temp&0x01)&&!(temp&(1<<16)));//等待时间到达   
	SysTick->CTRL=0x00;       //关闭计数器
	SysTick->VAL =0X00;       //清空计数器	  
	     
}

/******************************************************************************
* 函数名  : Delay_ms()
* 描述    : 软件延时，毫秒
* 输入    : time延时时间(单位：毫秒)
* 输出    : None
* 返回    : None
* 作者    :
* 创建日期: 02/07/2011 
* 版本    : V1.00
*******************************************************************************/
void  Delay_ms(uint16_t time_cn)
{
	uint32_t temp = time_cn*10000;
	while(temp--);	
}

//======================================================================
//                                   0ooo
//                          ooo0     (   ) 
//                          (   )     ) /
//                           \ (     (_/
//                            \_) 
//======================================================================





